{
    "items": [
      {
        "id": "1a",
        "name": "Gustaf Aulén",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Aulén revives the ancient “classic” or Christus Victor paradigm, insisting that the crucifixion is not a private legal bargain but the decisive battlefield where God overthrows the enslaving powers of Sin, Death, and the Devil. In this view the atonement is a drama, not a bookkeeping exercise. God’s love is active, militant, and victorious, liberating creation rather than merely adjusting a heavenly ledger. The triumph is therefore revelatory: it shows the universe who God is and how God rules.",
            "footnote": "Gustaf Aulén, Christus Victor (1931) ch. 3."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "For Aulén the cross discloses God as a warrior‑lover who stands in radical solidarity with victims. Divine omnipotence is redefined as courageous suffering on behalf of the oppressed—a sharp contrast to images of aloof sovereignty. The drama unmasks tyranny and simultaneously offers deliverance. In that unveiling we learn God’s true character: fearless compassion expressed through self‑sacrifice.",
            "footnote": "Christus Victor, pp. 59‑65."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "A key contribution of Aulén’s work is his critique of the later “Latin” satisfaction schemes. Those models, he argues, mute the narrative drama and hide the explosive love revealed at Golgotha behind juridical abstractions. By recovering the classic motif he re‑centers attention on revelation and liberation rather than payment and placation. The cross becomes a victory shout, not a commercial exchange, and the church is summoned to live in that freedom.",
            "footnote": "Christus Victor, pp. 82‑90."
          }
        ]
      },
      {
        "id": "1b",
        "name": "Athanasius",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "In the Incarnation, says Athanasius, the immortal Word clothed himself in mortal flesh so that death itself might be confronted from the inside. Corruption had entered the human frame, and only by entering that frame could the Logos expose and exhaust its power. The move is both curative and revelatory: God shows the depth of divine philanthrōpia by sharing our precarious condition. The cross, then, is the surgical strike against corruption that began at Bethlehem.",
            "footnote": "On the Incarnation §§20‑25."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Athanasius sees the crucifixion as the ultimate display of God’s benevolent love. By submitting to a public, shameful death, the Creator demonstrates that nothing—not even mortality—can defeat divine mercy. The spectacle educates humanity: it reveals the magnitude of God’s condescension and the lengths to which divine love will travel to rescue the beloved creation. Restoration of immortality flows from this unveiled compassion.",
            "footnote": "Incarnation §25."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Public execution was essential, Athanasius argues, because visibility matters in revelation. Christ’s open victory over death summons every witness—ancient and modern—to behold true God and real life. The resurrection seals the argument, showing that the one who died is sovereign over death itself. Thus the cross functions as theological pedagogy, awakening faith by what it publicly displays.",
            "footnote": "Incarnation §24."
          }
        ]
      },
      {
        "id": "1c",
        "name": "N. T. Wright",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Wright frames the crucifixion as the launch of God’s “new exodus,” the moment Israel’s God enacts covenant faithfulness on behalf of the whole world. The cross is therefore liberation from the overlords of idolatry and exile, not simply pardon for private guilt. Israel’s narrative climaxes as God personally bears the curse of exile to bring the slaves home. Calvary is the hinge between the gloom of bondage and the dawn of freedom.",
            "footnote": "N. T. Wright, The Day the Revolution Began (2016) pp. 71‑88."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "At Golgotha Sin is unmasked as a supra‑human enslaving force, and the vocation of genuine image‑bearing is re‑commissioned. In Paul’s language, new‑creation life erupts because Israel’s Messiah has been faithful even unto death. Humans are thereby invited to reflect self‑giving love into the world that God so loves. The cross, then, is both rescue and recommissioning ceremony.",
            "footnote": "Revolution, pp. 386‑397."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Easter, for Wright, is God’s public vindication of the crucified Messiah and the guarantee that the revolution has begun. Resurrection proves that the power revealed in weakness is destined to re‑make the cosmos. Followers of Jesus are called to anticipate this renewal in practical holiness and courageous justice. Thus cruciform power is not an oddity but the very destiny of God’s renewed world.",
            "footnote": "Revolution, pp. 421‑430."
          }
        ]
      },
      {
        "id": "2a",
        "name": "René Girard",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Girard’s theory of mimetic desire contends that we learn what to want by copying one another, inevitably fostering rivalry. As tensions mount, societies instinctively seek a scapegoat whose expulsion restores temporary peace. The cross shatters this cycle by exposing its mechanics in full daylight. When the crowds cry for Jesus’ blood, they reveal the ancient pattern; when God raises the innocent victim, the pattern is unmasked as a lie.",
            "footnote": "René Girard, I See Satan Fall Like Lightning (2001) pp. 141‑148."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Because Jesus is free of mimetic rivalry, his silence before accusers unveils violence as entirely human rather than divine. The sacred aura surrounding collective murder evaporates in the presence of the victim’s innocence. Scripture itself participates in this unveiling, interpreting the passion from the victim’s viewpoint rather than the mob’s. Thus sacred violence is revealed as fraudulent and unnecessary.",
            "footnote": "Things Hidden, pp. 189‑204."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Resurrection offers humanity a new possibility—what Girard calls a ‘pacific mimesis’. Instead of imitating rivalrous models, disciples imitate the forgiving victim who returns without vengeance. A new community can therefore arise, shaped by non‑rivalrous love. In that sense Easter is the birth of a culture no longer built on expelled victims.",
            "footnote": "Lightning, pp. 212‑220."
          }
        ]
      },
      {
        "id": "2b",
        "name": "James Alison",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Alison interprets original sin through a Girardian lens, describing humanity as imprisoned in rivalistic mimesis until the resurrection opens new sight. Only ‘through Easter eyes’ can we perceive the deep entanglement of desire and violence that shapes culture. Sin is not merely inherited guilt but a social pathology into which every newborn is enculturated. The cross reveals this pathology while offering release.",
            "footnote": "James Alison, The Joy of Being Wrong (1998) pp. 113‑139."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Baptism initiates believers into an alternative constitution of desire—what Alison calls pacific mimesis. The believer gradually unlearns rivalry by gazing on the forgiving Victim, a process both sacramental and psychological. Yet the old patterns resist eviction, making conversion an ongoing journey rather than a one‑time fix. Easter faith therefore requires sustained re‑learning of what it means to want.",
            "footnote": "Joy, pp. 182‑190."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Alison envisions salvation as the formation of communities that live forgiveness as their native language. Such communities give practical witness that scapegoating is unnecessary and reconciliation possible. They embody atonement not as transaction but as shared life in the Spirit of the Risen Lamb. In this sense the church itself becomes an ‘apocalypse of the forgiving victim’.",
            "footnote": "Joy, pp. 225‑232."
          }
        ]
      },
      {
        "id": "3a",
        "name": "Wolfhart Pannenberg",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Pannenberg calls the cross‑resurrection sequence a ‘proleptic revelation’ of the Last Judgment. Because the future verdict invades the middle of history in Jesus, all events are now to be interpreted from that eschatological horizon. The risen Crucified One is both object and subject of God’s final yes, anchoring human hope. History’s meaning is therefore unlocked from its end, not from its origins.",
            "footnote": "Pannenberg, Jesus—God and Man (1968) pp. 229‑241."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Divine self‑disclosure, for Pannenberg, does not bypass secular history; it occurs within it. The public character of resurrection means revelation is verifiable, not esoteric. Consequently Christian proclamation appeals to universal reason while still grounded in apocalyptic event. Hope becomes rational expectation rooted in an historical occurrence.",
            "footnote": "Jesus—God and Man, pp. 268‑272."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "The church lives between promise and consummation, embodying ‘anticipatory participation’ in reconciliation. Its vocation is to exhibit the rationality of love and the logic of self‑giving already certified by Easter. Such cruciform rationality challenges prevailing cultural logics of domination. Thus eschatology governs ethics in the present.",
            "footnote": "Systematic Theology 3 (1993) pp. 598‑610."
          }
        ]
      },
      {
        "id": "3b",
        "name": "Jürgen Moltmann",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Moltmann contends that at the moment of God‑forsakenness the triune God enters into the experience of abandonment. In that event mythic notions of omnipotence are shattered and replaced by the power of suffering love. The cross therefore tells us that God is not immune to pain but voluntarily bears it. This radical identification with the godless reveals divine solidarity with all who despair.",
            "footnote": "Jürgen Moltmann, The Crucified God (1974) pp. 205‑213."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Resurrection opens a future for the victims of history, validating their hope against every totalitarian ‘realism’. The church is summoned to live as a community of protest and anticipation—protest against fatalism, anticipation of new creation. Hope, then, is not wistful thinking but participation in God’s future already promised in the risen Christ. Practical discipleship becomes energized eschatology.",
            "footnote": "Crucified God, pp. 268‑276."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "For Moltmann the cross is the ‘open Trinity’: Father, Son, and Spirit are revealed in their mutual self‑giving. Humanity is invited into this perichoretic dance of inclusive love. The doctrine of God therefore emerges from Calvary, not philosophical first principles. To know the Trinity is to stand at the foot of the cross and be drawn into its embrace.",
            "footnote": "Moltmann, Trinitarian Doctrine (1981) pp. 243‑250."
          }
        ]
      },
      {
        "id": "3c",
        "name": "N. T. Wright",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "In Wright’s reading of Paul, Sin and Death are supra‑personal tyrants dethroned by the Messiah’s faithful obedience. The cross is therefore a cosmic power‑shift, not merely a private religious moment. This apocalyptic vision reshapes Christian identity as rescue from slavery rather than escape from penalty. Believers are ushered into the liberty of the messianic age.",
            "footnote": "Wright, Paul and the Faithfulness of God (2013) pp. 915‑930."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Cross plus resurrection is the climactic moment when Israel’s God publicly claims universal sovereignty. Pagan Caesars can no longer define lordship; the world’s true Lord reigns from a tree and an empty tomb. Political and cultural allegiances are relativized by this unveiling. Worship and mission alike become acts of loyal dissent against rival lordships.",
            "footnote": "Faithfulness, pp. 949‑957."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Because new creation has begun, the church lives in inaugurated eschatology. Justice, holiness, and beauty are anticipatory acts of resurrection life. Christian ethics therefore flows from eschatological imagination anchored in the cross. Ahead‑of‑time living makes the future visible in the present.",
            "footnote": "Faithfulness, pp. 1040‑1046."
          }
        ]
      },
      {
        "id": "4a",
        "name": "Walter Wink",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Wink argues that the crucifixion unmasks the ‘myth of redemptive violence’, showing it to be a self‑perpetuating deception maintained by the Powers. By absorbing violence without retaliation, Jesus exposes its impotence. The revelation is both theological and political: domination systems lose their aura of inevitability. The church inherits a vocation of naming and resisting that myth wherever it appears.",
            "footnote": "Wink, Engaging the Powers (1992) ch. 13."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "His praxis model—name, unmask, engage—insists that evil structures be addressed head‑on yet without mirroring their coercion. Redemption of the Powers, not annihilation, is the goal, because their original vocation was good. This stance guards activists from becoming what they oppose. In Wink’s synthesis spirituality and social analysis are inseparable.",
            "footnote": "Ibid., pp. 296‑301."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Prayer is the ‘interior battlefield’ where activists gain clairvoyance and compassion. Without deep contemplative rooting, non‑violent struggle morphs into another ideology serving a counter‑Power. Wink therefore fuses inner liberation with outer engagement, modelling a holistic discipleship. Social change begins in the imagination transformed by prayer.",
            "footnote": "Ibid., pp. 302‑305."
          }
        ]
      },
      {
        "id": "4b",
        "name": "John Howard Yoder",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Yoder claims the cross is a political event demonstrating that God rules, not by coercion, but by suffering service. Christ dethrones ‘common‑sense’ political realism by triumphing through apparent defeat. This unveils a radically different definition of sovereignty rooted in servanthood. True power is exercised through vulnerability.",
            "footnote": "Yoder, The Politics of Jesus (1972) pp. 132‑147."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "The church is the social body that embodies this upside‑down politics for the watching world. Its life together is a living exegesis of the gospel, more persuasive than abstract argument. When believers renounce retaliation and practice enemy love, they announce a new order under Christ’s lordship. Thus ecclesiology and ethics converge.",
            "footnote": "Politics, pp. 237‑248."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "History’s true climax is not achieved by pragmatic ‘realism’ but by the Lamb who was slain. Revelation’s imagery confirms that martyr‑witness, not violent victory, moves the plot toward consummation. Yoder invites the church to locate itself inside that apocalyptic narrative. Faithfulness, not effectiveness, is the criterion of success.",
            "footnote": "Politics, pp. 371‑379."
          }
        ]
      },
      {
        "id": "4c",
        "name": "Greg Boyd",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Boyd’s “warfare worldview” treats the cosmos as a contested arena in which God’s cruciform love clashes with entrenched demonic structures. The cross is the decisive victory that exposes these powers as parasites feeding on violence. Divine power is recast as self‑sacrificial rather than domineering. Calvary becomes the template for cosmic conflict.",
            "footnote": "Greg Boyd, God at War (1997) pp. 268‑280."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "In Crucifixion of the Warrior God Boyd describes divine omnipotence as consent to suffer for the beloved, even when that means enduring wrathful consequences of human sin. God’s power operates by winning hearts, not by crushing enemies. The cross thus corrects distorted images of deity that sanction violence. Omnipotence is cruciform.",
            "footnote": "Boyd, Crucifixion of the Warrior God (2017) vol. 1 pp. 77‑102."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Believers are enlisted into Christ’s campaign of ‘revolting love,’ confronting evil with non‑retaliatory service. Spiritual warfare is waged through compassionate action and truth‑telling rather than force. Partnering with the risen Lord, disciples participate in ongoing exposure and eviction of oppressive powers. The battlefield is everyday life.",
            "footnote": "God at War, pp. 300‑312."
          }
        ]
      },
      {
        "id": "5a",
        "name": "J. Denny Weaver",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Weaver’s narrative Christus Victor rejects the logic of blood‑payment and frames atonement as non‑violent divine action. God’s forgiveness flows freely, grounded in steadfast love rather than retributive necessity. This reorientation shifts focus from courtroom to conflict zone, where liberation is the goal. Peace, not penalty, becomes the heart of salvation.",
            "footnote": "Weaver, Nonviolent Atonement (2011) pp. 17‑35."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "In this model Jesus confronts a ‘constellation of powers’—social, political, spiritual—through a life of obedient, countercultural non‑resistance. His resurrection is divine endorsement of that strategy and the disclosure that violent powers are already judged. Salvation, therefore, is the gift of freedom from those powers. Disciples are called to imitate the same risk‑laden obedience.",
            "footnote": "Ibid., pp. 90‑102."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Because atonement is a story rather than a mechanism, it doubles as a model for discipleship. The church participates in redemption whenever it confronts violence with suffering witness and embodies restorative justice. Mission becomes the continuation of Jesus’ non‑violent victory in fresh settings. Atonement, ethics, and ecclesiology fuse into one narrative vocation.",
            "footnote": "Ibid., pp. 150‑162."
          }
        ]
      },
      {
        "id": "5b",
        "name": "Greg Boyd",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Boyd’s cruciform hermeneutic insists that every text, especially violent ones, be refracted through the prism of Calvary’s enemy love. Scripture is a story culminating in self‑sacrifice; interpretive fidelity means reading toward that climax. Apparent divine violence is therefore ‘re‑painted’ by the cross, revealing deeper purposes of patient love. The lens is cruciform or it is distorted.",
            "footnote": "Boyd, Cross Vision (2017) pp. 17‑40."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "One explanatory strategy Boyd develops is divine withdrawal: God sometimes steps back, allowing human and demonic agents to reap consequences, rather than personally smiting. The logic mirrors Good Friday, where the Father consents to the Son’s suffering at human hands. Such withdrawal exposes evil while respecting creaturely freedom. It reconfigures wrath as relinquishment, not retaliation.",
            "footnote": "Cross Vision, pp. 95‑108."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "At its heart Boyd’s project paints a spectacular vision of relentless divine love. The crucified Christ stands as definitive portrait of God’s character, rendering images of coercive wrath obsolete. Reading the Bible through this lens liberates believers to trust in unqualified mercy. It also fuels a non‑violent ethic rooted in the surety of that love.",
            "footnote": "Cross Vision, pp. 250‑258."
          }
        ]
      },
      {
        "id": "5c",
        "name": "Ty Gibson",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Gibson emphasizes the relational nature of divine government: at Calvary God demonstrates other‑centeredness that silences accusations of manipulative sovereignty. The cross answers the cosmic allegation that God cannot be trusted with freedom. Vulnerable love, not coercion, is revealed as heaven’s operating principle. Trust grows where fear once ruled.",
            "footnote": "Ty Gibson, See with New Eyes (2000) pp. 89‑101."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Gibson frames the atonement inside the Adventist ‘Great Controversy’ meta‑narrative: a cosmic courtroom drama in which the cross supplies definitive evidence for God’s righteousness. The revelation is addressed not only to Earth but to the watching universe. Thus Calvary functions apologetically as well as salvifically. The verdict vindicates God’s government of love.",
            "footnote": "See with New Eyes, pp. 112‑118."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Victory is achieved through transparent vulnerability: God wins by allowing himself to be wounded rather than by wounding. That transparency dismantles suspicion and invites relational trust. Fear‑driven obedience is replaced by love‑motivated loyalty. In this frame, power is measured by the capacity to serve and suffer.",
            "footnote": "Ibid., pp. 130‑134."
          }
        ]
      },
      {
        "id": "6a",
        "name": "Hans Urs von Balthasar",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "In the multi‑volume Theo‑Drama Balthasar portrays Calvary as God’s climactic self‑performance in the theater of history. The Son enacts absolute obedience; the Father enacts absolute self‑handing‑over; the Spirit choreographs the drama’s reception. The abyss of divine love is laid bare for creatures to behold. Revelation and redemption coincide in this dramatic act.",
            "footnote": "Balthasar, Theo‑Drama IV (1983) pp. 319‑337."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Kenosis, far from diminution, is radiant glory: the more God gives away, the more God is revealed as God. Power is thus re‑conceptualized as ecstatic self‑gift rather than sovereign control. The cross instantiates this paradox in flesh and blood. Balthasar calls the church to aesthetic wonder before such splendor.",
            "footnote": "Ibid., pp. 370‑378."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Trinitarian mission flows outward as the church is drawn into the same dramatic self‑outpouring. Liturgy rehearses the drama; ethics extends it into the world. Evangelization therefore means inviting others onto the stage of divine kenosis. Salvation is participation in Trinitarian love performed publicly.",
            "footnote": "Ibid., pp. 438‑445."
          }
        ]
      },
      {
        "id": "6b",
        "name": "Peter Abelard",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Abelard sees the cross primarily as a moral exhibition: God’s supreme demonstration of love intended to kindle a corresponding love within human hearts. The drama persuades rather than pays. Divine pedagogy aims at transformation of affections, not adjustment of penalties. Love awakens love in return.",
            "footnote": "Abelard, Commentary on Romans §2."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Justice, in this schema, is fulfilled when hearts are converted to charity. Law finds its goal, not in exact retribution, but in the internalization of divine goodness. God persuades without coercing, honoring the dignity of human response. Thus moral influence is elevated over forensic exchange.",
            "footnote": "Commentary on Romans §3."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Abelard’s emphasis on character revelation reframes reconciliation: humanity returns to God because God’s beauty has been made irresistible. Atonement is therefore relational restoration, not commercial settlement. Faith sees the crucified Lover and is drawn home. Eternal communion, not acquittal alone, is the telos.",
            "footnote": "Ibid."
          }
        ]
      },
      {
        "id": "6c",
        "name": "Ellen G. White",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "White depicts Calvary as the universe’s definitive revelation of God’s heart, permanently refuting Satan’s claim that the divine law is arbitrary. In the suffering of the Son the angels behold the unalterable harmony of justice and mercy. Law is shown to be an expression of self‑giving love, not tyrannical fiat. The controversy about God’s character is settled at the cross.",
            "footnote": "Ellen G. White, Desire of Ages (1898) ch. ‘It Is Finished’."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "White stresses that the Father suffers with the Son, revealing self‑sacrifice as the law of life for earth and heaven alike. Atonement flows naturally from eternal love; it is not a device to procure love. The cosmos learns that power lies in service, not domination. The cross is therefore the moral center of the universe.",
            "footnote": "Jonathan Gallagher, “Meaning of the Atonement” (2003) pp. 2‑4."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "By exposing sin’s deadly nature and God’s compassionate resilience, Calvary secures the loyalty of unfallen worlds. The redeemed and the unfallen together see the contrast between self‑centered rebellion and self‑giving love. Loyalty is now grounded in admiration rather than fear. The government of love stands forever vindicated.",
            "footnote": "Great Controversy (1911) pp. 501‑504."
          }
        ]
      },
      {
        "id": "7a",
        "name": "Michael J. Gorman",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Gorman coins ‘cruciformity’ to describe the Spirit‑enabled participation in Christ’s self‑emptying love. Believers become living commentaries on Calvary, embodying a narrative spirituality shaped by the ‘although–not–but’ pattern of Philippians 2. The cross is not merely remembered but inhabited. Discipleship is narrative union with the Crucified.",
            "footnote": "Gorman, Cruciformity (2001) pp. 39‑57."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "He proposes that justification is incorporation into the justice‑love of God revealed at the cross, not simply a courtroom verdict. Being declared righteous means being woven into the fabric of self‑giving love. Thus soteriology and ethics are inseparable: right standing generates right living shaped by the same cruciform pattern. Salvation is participation, not spectator status.",
            "footnote": "JSPL 1 (2011) 23‑40."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Mission, for Gorman, is kenotic extension of Christ’s ministry: communities practice enemy love, economic sharing, and boundary‑crossing reconciliation. The church becomes a ‘living exegesis’ of the gospel, interpreting Scripture by enacting it. Such performance persuades a watching world more than abstract propositions. Cruciformity thus fuels missional credibility.",
            "footnote": "Inhabiting the Cruciform God (2009) pp. 129‑146."
          }
        ]
      },
      {
        "id": "7b",
        "name": "Scot McKnight",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "McKnight argues that the cross forms a missional community whose very life is reconciliation. Salvation is a ‘community project’ where restored relationships become the medium of gospel announcement. Justice and peace are enacted, not merely proclaimed. The church is cross‑shaped or it is something else.",
            "footnote": "McKnight, A Community Called Atonement (2007) pp. 108‑117."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "He synthesizes multiple metaphors—substitution, victory, recapitulation—into the overarching theme of divine love revealed in self‑sacrifice. Each image is a window; together they form a stained‑glass narrative. Liturgy rehearses this story, embedding it in communal memory. Ethical life flows from repeated enactment.",
            "footnote": "Ibid., pp. 45‑57."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "Baptism and Eucharist, in McKnight’s schema, draft believers into the Good Friday revolution. These practices energize a cruciform imagination that spills into hospitality, forgiveness, and public justice. Sacramental theology and social ethics are thus welded together. The table becomes training ground for the streets.",
            "footnote": "Ibid., pp. 173‑180."
          }
        ]
      },
      {
        "id": "7c",
        "name": "Joel B. Green & Mark D. Baker",
        "sectionProperties": ["aspect_title", "insight_text", "footnote"],
        "sections": [
          {
            "aspect_title": "Insight 1",
            "insight_text": "Green and Baker recover the ‘scandal’ by showing how the cross, read as narrative rather than theory, discloses God’s intent to restore broken creation. Atonement is not a single‑term equation but a many‑coloured tapestry. Narrative reading re‑integrates social, political, and personal dimensions of salvation. The scandal is its breadth as much as its depth.",
            "footnote": "Green & Baker, Recovering the Scandal of the Cross 2nd ed. (2011) pp. 29‑44."
          },
          {
            "aspect_title": "Insight 2",
            "insight_text": "Critiquing punitive paradigms opens imaginative space for practices like hospitality to outcasts, forgiveness of offenders, and solidarity with the oppressed. Atonement is experienced as concrete transformation, not abstract satisfaction. The cross thus becomes a social ethic. Theology discovers its telos in community habits.",
            "footnote": "Ibid., pp. 165‑178."
          },
          {
            "aspect_title": "Insight 3",
            "insight_text": "They insist that community itself becomes the hermeneutic of atonement: when believers live cross‑shaped lives, the meaning of Calvary is made visible and plausible. Lived interpretation out‑preaches theoretical argument. Mission, therefore, is a communal performance of reconciliation. The watching world reads the gospel in cruciform social practices.",
            "footnote": "Ibid., pp. 189‑198."
          }
        ]
      }
    ]
  }
  